
## Terraform plan for account: `nonprod`

**Commit:** 267fb2b6b400957a579877f12b69df95b09b368b

### Plan summary

`5 to add, 0 to change, 0 to destroy`

**🆕 Creates**

```tf
module.account.aws_ecr_repository_policy.mock_govuk_signin_lambda[0]
module.account.module.ecr["mock-govuk-signin"].aws_ecr_lifecycle_policy.this[0]
module.account.module.ecr["mock-govuk-signin"].aws_ecr_registry_scanning_configuration.this[0]
module.account.module.ecr["mock-govuk-signin"].aws_ecr_repository.this[0]
module.account.module.ecr["mock-govuk-signin"].aws_ecr_repository_policy.this[0]
```


----

<details data-gh-workflow="nonprod-account-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.account.aws_ecr_repository_policy.mock_govuk_signin_lambda[0] will be created
  + resource "aws_ecr_repository_policy" "mock_govuk_signin_lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = "AllowLambdaPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region      = "eu-west-1"
      + registry_id = (known after apply)
      + repository  = "vol-app/mock-govuk-signin"
    }

  # module.account.module.ecr["mock-govuk-signin"].aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 20 release images"
                      + rulePriority = 10
                      + selection    = {
                          + countNumber    = 20
                          + countType      = "imageCountMoreThan"
                          + tagPatternList = [
                              + "*.*.*",
                            ]
                          + tagStatus      = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 20 non-release images"
                      + rulePriority = 20
                      + selection    = {
                          + countNumber    = 20
                          + countType      = "imageCountMoreThan"
                          + tagPatternList = [
                              + "*",
                            ]
                          + tagStatus      = "tagged"
                        }
                    },
                ]
            }
        )
      + region      = "eu-west-1"
      + registry_id = (known after apply)
      + repository  = "vol-app/mock-govuk-signin"
    }

  # module.account.module.ecr["mock-govuk-signin"].aws_ecr_registry_scanning_configuration.this[0] will be created
  + resource "aws_ecr_registry_scanning_configuration" "this" {
      + id          = (known after apply)
      + region      = "eu-west-1"
      + registry_id = (known after apply)
      + scan_type   = "ENHANCED"

      + rule {
          + scan_frequency = "SCAN_ON_PUSH"

          + repository_filter {
              + filter      = "*"
              + filter_type = "WILDCARD"
            }
        }
      + rule {
          + scan_frequency = "CONTINUOUS_SCAN"

          + repository_filter {
              + filter      = "*.*.*"
              + filter_type = "WILDCARD"
            }
        }
    }

  # module.account.module.ecr["mock-govuk-signin"].aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "vol-app/mock-govuk-signin"
      + region               = "eu-west-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.account.module.ecr["mock-govuk-signin"].aws_ecr_repository_policy.this[0] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::054614622558:role/vol-app-github-actions-role",
                              + "arn:aws:iam::054614622558:role/vol-app-github-actions-readonly-role",
                            ]
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                  + {
                      + Action    = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::054614622558:role/vol-app-github-actions-role"
                        }
                      + Sid       = "ReadWrite"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region      = "eu-west-1"
      + registry_id = (known after apply)
      + repository  = "vol-app/mock-govuk-signin"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```

</details>